# 2.Python语言基础

## 2.2 IPython基础

### 2.2.4 内省

In [2]:
#在一个变量后使用问号（？）以显示概要信息
b=[1,2,3]
b?

In [4]:
#对函数使用？显示文档字符串，使用？？显示源代码
def add(x,y):
    """得到和，            #三个双引号输出字符串换行不用\n转义符
    再返回"""
    sum=x+y
    return sum
add?

In [5]:
add??

## 2.3 Python语言基础

### 2.3.1 语言语义

#### 2.3.1.6 动态引用、强类型

In [6]:
#隐式的类型转换只在特定的情况下发生
5/2

2.5

In [7]:
#如果希望像C语言一样得到int类型，使用//
5//2

2

In [8]:
#使用isinstance判别类型,可以使用类型为对象的元组
a=5
isinstance(a, int)

True

In [9]:
isinstance(a, (int, float))

True

#### 2.3.1.10 二元运算符和比较运算

操作符|含义
--|--
a//b|a整除b
a**b|a的b次方
a^b|a异或b
a==b|a和b的值相等
a is b|a和b为同一个对象

### 2.3.2 标量类型

#### 2.3.2.2 字符串

In [28]:
c="""
this is a string that
spans mutiple rows
"""
#包含四行，三个换行符
c.count('\n')

3

In [29]:
#字符串不可变，你无法修改一个字符串
c[1]='q'

TypeError: 'str' object does not support item assignment

In [31]:
d=c.replace('string', 'longer string')
print(d)

this is a longer string that
spans mutiple rows

In [32]:
#反斜杠是一种转义符，字符串中写反斜杠需要将其转义
e='12\\34'
print(e)

12\34

In [33]:
#加前缀符号r以表示原生字符
f=r'this\is\no\special\character'
print(f)

this\is\no\special\character

In [34]:
#使用+连接两个字符串
e+' '+f

'12\\34 this\\is\\no\\special\\character'

In [35]:
#使用format字符串格式化
template='{0:.2f} {1:s} are worth US${2:d}' #格式分别为两位小数的浮点数，字符串，整数
template.format(4.566,'Argentine Pesos', 1)

'4.57 Argentine Pesos are worth US$1'

#### 2.3.2.7 日期和时间

In [36]:
from datetime import datetime,date,time
dt=datetime(2011,10,29,20,30,21)
dt.day,dt.hour, dt.minute

(29, 20, 30)

In [37]:
dt.date(),dt.time()

(datetime.date(2011, 10, 29), datetime.time(20, 30, 21))

In [38]:
#使用strftimw将时间转换成字符串
dt.strftime('%Y-%m-%d %H:%M:%S')

'2011-10-29 20:30:21'

In [39]:
#使用strptime将字符串转为时间
datetime.strptime('20111029','%Y%m%d')

datetime.datetime(2011, 10, 29, 0, 0)

类型|描述
--|--
%Y|四位年份
%y|两位年份
%m|两位月份
%d|两位天数
%H|24小时制小时
%h|12小时制小时
%M|分钟
%S|秒
%w|星期几
%F|2012-04-17格式
%D|04/17/12格式

In [40]:
#datetime不可变，使用replace替换生成新对象
dt.replace(minute=0,second=0)

datetime.datetime(2011, 10, 29, 20, 0)

In [42]:
#两datetime相减产生一个datetime.timedelta对象
dt2=datetime(2011,11,15,22,30)
delta=dt2-dt
delta,type(delta)

(datetime.timedelta(days=17, seconds=7179), datetime.timedelta)

In [45]:
#tiemedelta+datetime将产生一个新对象
delta+dt

datetime.datetime(2011, 11, 15, 22, 30)

In [46]:
#输出当前日期和时间
datetime.today()

datetime.datetime(2019, 5, 21, 20, 56, 30, 738727)

### 2.3.3 控制流

#### 2.3.3.1 if、elif、else

In [48]:
x=3
if x<0:
    print('Negative')
elif x==0:
    print('Equal to zero')
else:
    print('Positive')

Positive

In [49]:
#链式的比较也是可以的
5>4>3>2>1

True

#### 2.3.3.2 for循环

In [50]:
#使用continue进入下一次循环
seq=[1,None,3,None,5]
sum=0
for i in seq:
    if i==None:
        continue
    sum+=i
sum

9

In [51]:
#break只结束最内层的循环，外层的循环会继续执行
for i in range(4):
    for j in range(4):
        if i<j:
            break
        print(i,j)

0 0
1 0
1 1
2 0
2 1
2 2
3 0
3 1
3 2
3 3

#### 2.3.3.3 while循环

In [52]:
x=256
total=0
while x>0:
    if total>500:
        break
    total+=x
    x=x//2
total

504

#### 2.3.3.4 pass

pass表示什么也不做，作为还未实现的代码的占位符，保证编译成功

# 3 内建数据结构、函数和文件

## 3.1 数据结构和序列

### 3.1.1 元组

In [55]:
tup1=4,5,6
tup1

(4, 5, 6)

In [56]:
tup2=(2,3),tup1
tup2

((2, 3), (4, 5, 6))

In [58]:
tup3=tuple('string')
tup3

('s', 't', 'r', 'i', 'n', 'g')

In [61]:
tup3[0]

's'

In [63]:
#元组不可变
#如果元组内部对象是可变的，如列表，你可以在它内部修改
tup4='foo',[1,2,3],True
tup4[1][2]=4
tup4

('foo', [1, 2, 4], True)

In [64]:
#使用+生成更长的元组
tup4+tup3

('foo', [1, 2, 4], True, 's', 't', 'r', 'i', 'n', 'g')

In [65]:
#使用*生成更长的元组
tup4*2

('foo', [1, 2, 4], True, 'foo', [1, 2, 4], True)

#### 3.1.1.1 元组拆包

In [67]:
a,b=tup2
print(a)
print(b)

(2, 3)
(4, 5, 6)

In [68]:
a,b=b,a
print(a)
print(b)

(4, 5, 6)
(2, 3)

In [70]:
seq=[(1,2,3),(4,5,6),(7,8,9),(10,11,12)]
for a,b,c in seq:
    r='a={0},b={1},c={2}'.format(a,b,c)
    print(r)

a=1,b=2,c=3
a=4,b=5,c=6
a=7,b=8,c=9
a=10,b=11,c=12

In [71]:
tup5=range(5)
p,q,*rest=tup5
rest

[2, 3, 4]

#### 3.1.1.2 元组方法

In [72]:
tup6=1,2,2,2,3,4,2
tup6.count(2)

4

### 3.1.2列表

#### 3.1.2.1 增加和移除元素

In [75]:
list1=['foo','peekaboo','baz']
list1.append('dwarf')
list1

['foo', 'peekaboo', 'baz', 'dwarf']

In [76]:
list1.insert(1,'red')
list1

['foo', 'red', 'peekaboo', 'baz', 'dwarf']

In [77]:
list1.pop(2)
list1

['foo', 'red', 'baz', 'dwarf']

In [78]:
#remove会移除第一个符合要求的对象
list1.append('foo')
list1.remove('foo')
list1

['red', 'baz', 'dwarf', 'foo']

In [79]:
'dwarf' not in list1

False

#### 3.1.2.2 连接和联合列表

In [80]:
#使用+连接
list2=[7,8,(2,3)]
list1+list2

['red', 'baz', 'dwarf', 'foo', 7, 8, (2, 3)]

In [83]:
#使用extend连接并修改
list2.extend(list2)
list2

[7, 8, (2, 3), 7, 8, (2, 3)]

In [84]:
#使用*连接
[1,2,3]*2

[1, 2, 3, 1, 2, 3]

#### 3.1.2.3 排序

In [85]:
a=[7,2,5,1,3]
a.sort()
a

[1, 2, 3, 5, 7]

In [89]:
#降序
a.sort(reverse=True)
a

[7, 5, 3, 2, 1]

In [90]:
#反转
a.reverse()
a

[1, 2, 3, 5, 7]

In [88]:
#根据不同关键字进行排序
b=['small','saw','He','foxes','six']
b.sort(key=len)
b

['He', 'saw', 'six', 'small', 'foxes']

#### 3.1.2.4 二分搜索和已排序表的维护

In [92]:
#bisect寻找应当被插入的位置，多个相等值则是最后一位
#对未升序排列的列表不会报错，但结果可能不正确
import bisect
c=[1,2,2,2,3,4,4,7]
r1=bisect.bisect(c,2)
r2=bisect.bisect(c,4)
print(r1)
print(r2)

4
7

In [94]:
#insort插值
bisect.insort(c,2)
bisect.insort(c,4)
c

[1, 2, 2, 2, 2, 2, 3, 4, 4, 4, 4, 7]

### 3.1.3 内建序数函数

#### 3.1.3.1 enumerate

In [95]:
#enumerate返回（i,value)元组的序列
list2=['foo','bar','baz']
mapping={}
for i,v in enumerate(list2):
    mapping[i]=v
mapping

{0: 'foo', 1: 'bar', 2: 'baz'}

#### 3.1.3.2 sorted

In [96]:
sorted('horse race', reverse=True)

['s', 'r', 'r', 'o', 'h', 'e', 'e', 'c', 'a', ' ']

#### 3.1.3.3 zip

In [98]:
#zip将元组、列表或其他序列的元素配对，新建一个元组对象的列表
#zip是一个生成器
seq1=['foo','bar','baz']
seq2=['one','two','three']
zipped=zip(seq1,seq2)
list(zipped)

[('foo', 'one'), ('bar', 'two'), ('baz', 'three')]

In [99]:
for i,(a,b) in enumerate(zip(seq1,seq2)):
    output='{0}:{1},{2}'.format(i,a,b)
    print(output)

0:foo,one
1:bar,two
2:baz,three

In [103]:
e=[]
e.append('sdd')

In [104]:
e

['sdd']

In [105]:
list('add')

['a', 'd', 'd']

In [106]:
#序列内各对象的元素配对
pitchers=[('Nolan','Ryan'),('Roger','Clemens'),('Schilling','Curt')]
firstname,lastname=zip(*pitchers)
print(firstname)
print(lastname)

('Nolan', 'Roger', 'Schilling')
('Ryan', 'Clemens', 'Curt')

In [107]:
#reversed将序列反转
#reversed是一个生成器，如果没有实例化，不会返回值
list(reversed(range(6)))

[5, 4, 3, 2, 1, 0]

### 3.1.4 字典

In [108]:
d1={'a':'somevalue','b':[1,2,3,4]}
d1

{'a': 'somevalue', 'b': [1, 2, 3, 4]}

In [109]:
d1[7]='an integer'
d1

{'a': 'somevalue', 'b': [1, 2, 3, 4], 7: 'an integer'}

In [110]:
d1['b']

[1, 2, 3, 4]

In [111]:
'b' in d1

True

In [113]:
d1[5]='some value'
d1['dummy']='another value'
d1

{'a': 'somevalue',
 'b': [1, 2, 3, 4],
 7: 'an integer',
 5: 'some value',
 'dummy': 'another value'}

In [114]:
del d1[5]
d1

{'a': 'somevalue',
 'b': [1, 2, 3, 4],
 7: 'an integer',
 'dummy': 'another value'}

In [115]:
d1.pop('dummy')

'another value'

In [116]:
d1

{'a': 'somevalue', 'b': [1, 2, 3, 4], 7: 'an integer'}

In [117]:
d1.keys()

dict_keys(['a', 'b', 7])

In [118]:
d1.values()

dict_values(['somevalue', [1, 2, 3, 4], 'an integer'])

In [119]:
#update更新字典，有相同键则会覆盖原字典
d1.update({'b':'foo','c':122}
d1

{'a': 'somevalue', 'b': 'foo', 7: 'an integer', 'c': 122}

#### 3.1.4.1 从序列生成字典

In [121]:
mapping1={}
for a,b in zip(range(5),reversed(range(5))):
               mapping1[a]=b
mapping1

{0: 4, 1: 3, 2: 2, 3: 1, 4: 0}

In [123]:
#字典接受一个两元素元组的序列作为参数
mapping2=dict(zip(range(5),reversed(range(5))))
mapping2

{0: 4, 1: 3, 2: 2, 3: 1, 4: 0}

#### 3.1.4.2 默认值

In [125]:
key=['default',0,1]
for i in key:
    value=mapping2.get(i,'Not in it')
    print(value)

Not in it
4
3

In [1]:
words=['apple','bat','bar','atom','book']
byletter={}
for word in words:
    letter=word[0]
    if letter not in byletter:
        byletter[letter]=[word]
    else:
        byletter[letter].append(word)
byletter

{'a': ['apple', 'atom'], 'b': ['bat', 'bar', 'book']}

In [5]:
#字典里的getdefault就是为了这个目的产生的
byletter={}
for word in words:
    letter=word[0]
    byletter.setdefault(letter,[]).append(word)
byletter

{'a': ['apple', 'atom'], 'b': ['bat', 'bar', 'book']}

In [6]:
#s使用defaultdict(list)
from collections import defaultdict
byletter=defaultdict(list)
for word in words:
    byletter[word[0]].append(word)
byletter

defaultdict(list, {'a': ['apple', 'atom'], 'b': ['bat', 'bar', 'book']})

#### 3.1.4.3 有效的字典键类型

In [8]:
#尽管字典的值可以是任何对象
#但字典的键必须是不可变对象，比如标量类型，元组
#且元组内对象也必须是不可变对象
#通过hash判断能否哈希化
h1=hash('string')
h2=hash((1,2,(3,4)))
print(h1)
print(h2)

3237287834078235467
-2725224101759650258

In [9]:
hash((1,2,[3,4]))

TypeError: unhashable type: 'list'

### 3.1.5 集合

In [10]:
#使用set创建集合
set([1,2,2,2,3,3])

{1, 2, 3}

In [11]:
#使用大括号创建集合
{1,2,2,2,3,3}

{1, 2, 3}

In [1]:
a={1,2,3,4,5}

In [2]:
b={3,4,5,6,7,8}

In [3]:
a.union(b)

{1, 2, 3, 4, 5, 6, 7, 8}

In [4]:
a|b

{1, 2, 3, 4, 5, 6, 7, 8}

In [5]:
a.intersection(b)

{3, 4, 5}

In [6]:
a&b

{3, 4, 5}

函数|替代|描述
------|--|--
a.add(x)|NA|
a.clear()|NA|重置为空
a.remove(x)|NA|移除某个元素
a.pop()|NA|移除任意元素
a.union(b)|a\|b|
a.update(b)|a\|=b|将a设置为并集
a.intersection(b)|a&b|
a.intersection_update(b)|a&=b|将b设置为交集
a.difference(b)|a-b|
a.difference_update(b)|a-=b|
a.symmetric_difference(b)|a^b|并集减去交集
a.symmetric_difference_update(b)|a^=b|
a.issubset(b)|NA|a是b的子集则返回True
a.issuperset(b)|NA|a包含b则返回True
a.isdisjoint(b)|NA|ab没有交集则返回True

In [7]:
c=a.copy()
c|=b
c

{1, 2, 3, 4, 5, 6, 7, 8}

In [8]:
a

{1, 2, 3, 4, 5}

In [9]:
#和字典类似，集合元素必须是不可变的。
#如果想要包含列表型的元素，必须转化为元组
mydata=[1,2,3,4]
myset={tuple(mydata)}
myset

{(1, 2, 3, 4)}

In [10]:
set(mydata)

{1, 2, 3, 4}

### 3.1.6 列表、集合和字典的推导式

In [11]:
#列表推导式过滤一个集中的元素，生成一个新的列表
strings=['a','as','bat','car','dove','python']
[x.upper() for x in strings if len(x)>2]

['BAT', 'CAR', 'DOVE', 'PYTHON']

In [12]:
#集合推导式
unique_length={len(x) for x in strings}
unique_length

{1, 2, 3, 4, 6}

In [13]:
set(map(len,strings))

{1, 2, 3, 4, 6}

In [14]:
#字典推导式
loc_mapping={val:index for index,val in enumerate(strings)}
loc_mapping

{'a': 0, 'as': 1, 'bat': 2, 'car': 3, 'dove': 4, 'python': 5}

In [15]:
[1,1,1,12,2].count(1)

3

#### 3.1.6.1 嵌套列表推导式

In [16]:
alldata=[['John','Emily','Michael','Mary','Steve'],
          ['Maria','Juan','Javier','Natalia','Pilar']]

names_wanted=[name for names in alldata for name in names if name.count('e')>=2]

names_wanted

['Steve']

In [17]:
some_tuples=[(1,2,3),(4,5,6),(7,8,9)]

flattened=[x for tuple in some_tuples for x in tuple]

flattened

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [18]:
[[x for x in tuple] for tuple  in some_tuples]

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

## 3.2函数

In [19]:
def mf(x,y,z=1.5):
    if z>1:
        return z*(x+y)
    else:
        return z/(x+y)

In [20]:
mf(1,1)

3.0

In [21]:
mf(1,1,2)

4

In [22]:
mf(1,1,-2)

-1.0

### 3.2.1 命名空间

In [24]:
#函数中定义的环境变量会被销毁
#但可以显示声明为全局变量
def a1():
    global fix
    fix=54
    return fix

a1()
fix

54

### 3.2.3 函数是对象

In [1]:
import re

def clean_strings(strings):
    result=[]
    for value in strings:
        value=value.strip()
        value=re.sub('[!#?]','',value)
        value=value.title()
        result.append(value)
    return result

states=['   Alabama', 'Georgial', 'georgial', 'FlOrIda',
        'south   carolina##', 'West virginia']

clean_strings(states)

['Alabama',
 'Georgial',
 'Georgial',
 'Florida',
 'South   Carolina',
 'West Virginia']

In [4]:
import re

def remove_punctuation(value):
    return re.sub('[!#?]','',value)

clean_ops=[str.strip, remove_punctuation, str.title]

def clean_strings(strings):
    result=[]
    for value in strings:
        for function in clean_ops:
            value=function(value)
        result.append(value)
    return result

clean_strings(states)

['Alabama',
 'Georgial',
 'Georgial',
 'Florida',
 'South   Carolina',
 'West Virginia']

In [5]:
#可以将函数作为参数传给其他函数
#如map函数，可以将函数应用到序列上
[x for x in map(remove_punctuation, states)]

['   Alabama',
 'Georgial',
 'georgial',
 'FlOrIda',
 'south   carolina',
 'West virginia']

### 3.2.4 匿名（Lambda）函数

In [6]:
strings=['foo','card','bar','aaaa','abab']

strings.sort(key=lambda x: len(set(list(x))))

strings

['aaaa', 'foo', 'abab', 'bar', 'card']

### 3.2.6 生成器

In [8]:
def squares(n=10):
    for i in range(1,n+1):
        yield i**2
        
gen=squares()    
for x in gen:
    print(x, end='  ')

1  4  9  16  25  36  49  64  81  100

#### 3.2.6.1 生成器表达式

In [9]:
#用生成器表达式创建生成器
gen=(x**2 for x in range(1,11))

sum(gen)

385

In [10]:
dict((i,i**2) for i in range(5))

{0: 0, 1: 1, 2: 4, 3: 9, 4: 16}

#### 3.2.6.2 itertools模块

In [12]:
import itertools

first_letter=lambda x:x[0]

allnames=['Alan','Adam','Wes','Will','Albert','Steven']

for key,names in itertools.groupby(allnames, first_letter):
    print(key, list(names))  #names是一个迭代器

A ['Alan', 'Adam']
W ['Wes', 'Will']
A ['Albert']
S ['Steven']

In [14]:
[x for x in itertools.combinations([1,2,3,4,5],3)]

[(1, 2, 3),
 (1, 2, 4),
 (1, 2, 5),
 (1, 3, 4),
 (1, 3, 5),
 (1, 4, 5),
 (2, 3, 4),
 (2, 3, 5),
 (2, 4, 5),
 (3, 4, 5)]

In [15]:
[x for x in itertools.combinations_with_replacement([1,2,3,4,5],3)]

[(1, 1, 1),
 (1, 1, 2),
 (1, 1, 3),
 (1, 1, 4),
 (1, 1, 5),
 (1, 2, 2),
 (1, 2, 3),
 (1, 2, 4),
 (1, 2, 5),
 (1, 3, 3),
 (1, 3, 4),
 (1, 3, 5),
 (1, 4, 4),
 (1, 4, 5),
 (1, 5, 5),
 (2, 2, 2),
 (2, 2, 3),
 (2, 2, 4),
 (2, 2, 5),
 (2, 3, 3),
 (2, 3, 4),
 (2, 3, 5),
 (2, 4, 4),
 (2, 4, 5),
 (2, 5, 5),
 (3, 3, 3),
 (3, 3, 4),
 (3, 3, 5),
 (3, 4, 4),
 (3, 4, 5),
 (3, 5, 5),
 (4, 4, 4),
 (4, 4, 5),
 (4, 5, 5),
 (5, 5, 5)]

In [16]:
[x for x in itertools.permutations([1,2,3,4],2)]

[(1, 2),
 (1, 3),
 (1, 4),
 (2, 1),
 (2, 3),
 (2, 4),
 (3, 1),
 (3, 2),
 (3, 4),
 (4, 1),
 (4, 2),
 (4, 3)]

In [153]:
list_1=[['A','B','C'],[1,2,3],['是','否']]

[x for x in itertools.product(*list_1,repeat=1)]

[('A', 1, '是'),
 ('A', 1, '否'),
 ('A', 2, '是'),
 ('A', 2, '否'),
 ('A', 3, '是'),
 ('A', 3, '否'),
 ('B', 1, '是'),
 ('B', 1, '否'),
 ('B', 2, '是'),
 ('B', 2, '否'),
 ('B', 3, '是'),
 ('B', 3, '否'),
 ('C', 1, '是'),
 ('C', 1, '否'),
 ('C', 2, '是'),
 ('C', 2, '否'),
 ('C', 3, '是'),
 ('C', 3, '否')]

### 3.2.7 错误和异常处理

In [21]:
#使用try/except是出现错误时返回值

def attempt_float(x):
    try:
        return float(x)
    except:
        return x

attempt_float('1.23')

1.23

In [22]:
attempt_float('one')

'one'

In [24]:
#只处理ValueError而不处理TypeError

def attempt_float(x):
    try:
        return float(x)
    except ValueError:
        return x

attempt_float('1.23')

1.23

In [25]:
attempt_float('one')

'one'

In [26]:
attempt_float((1,2))

TypeError: float() argument must be a string or a number, not 'tuple'

In [27]:
#使用finally在代码不论成功与否的情况下都会执行finally下的语句

#使用else只在代码成功通过是会执行

def attempt_float(x):
    try:
        g=float(x)
    except ValueError:
        return x
    else:
        return print('Success\n',g)

attempt_float('1.23')

Success
 1.23

In [28]:
str='1.23'

try:
    g=float(str)
except:
    print('Error')
else:
    print('Success\n',g)

Success
 1.23

# 4 Numpy基础

## 4.1 Numpy ndarray:多维数组对象

In [29]:
import numpy as np

data=np.random.randn(2,3)
data

array([[-0.11514202,  0.79096226,  1.30138281],
       [-2.02345501,  0.52925519,  0.18121315]])

In [30]:
data*10

array([[ -1.1514202 ,   7.90962263,  13.01382812],
       [-20.23455011,   5.29255186,   1.81213155]])

In [31]:
data+data

array([[-0.23028404,  1.58192453,  2.60276562],
       [-4.04691002,  1.05851037,  0.36242631]])

In [32]:
data.shape

(2, 3)

In [33]:
data.dtype

dtype('float64')

### 4.1.1 生成ndarray

In [34]:
data1=[6,7.5,8,0,1]

arr1=np.array(data1)
arr1

array([6. , 7.5, 8. , 0. , 1. ])

In [35]:
data2=[[1,2,3,4],[5,6,7,8]]

arr2=np.array(data2)
arr2

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [36]:
arr2.ndim

2

In [37]:
arr2.shape

(2, 4)

In [39]:
np.zeros((3,6))

array([[0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.]])

In [40]:
#使用np.empty有时会返回垃圾数值
np.empty((2,3,2))

array([[[0., 0.],
        [0., 0.],
        [0., 0.]],

       [[0., 0.],
        [0., 0.],
        [0., 0.]]])

In [42]:
np.ones_like(arr2)

array([[1, 1, 1, 1],
       [1, 1, 1, 1]])

In [45]:
np.full((2,3),9)

array([[9, 9, 9],
       [9, 9, 9]])

In [46]:
np.full_like(arr2,10086)

array([[10086, 10086, 10086, 10086],
       [10086, 10086, 10086, 10086]])

In [47]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [41]:
#arange是Numpy版的range
np.arange(15)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

### 4.1.2 ndarray的数据类型

In [48]:
arr3=np.array([1,2,3,4,5])
float_arr=arr3.astype(np.float64)
float_arr.dtype

dtype('float64')

In [49]:
arr4=np.array([3.7,-1.2,-2.6,.5,12.9,10.1])
arr4.astype(np.int32)

array([ 3, -1, -2,  0, 12, 10])

In [50]:
str_arr=np.array(['1.25','-9.6','42'])
str_arr.astype(float)

array([ 1.25, -9.6 , 42.  ])

In [51]:
arr4.astype(str_arr.dtype)

array(['3.7', '-1.2', '-2.6', '0.5', '12.9', '10.1'], dtype='<U4')

### 4.1.3 Numpy数组算术

In [53]:
arr5=np.array([[1,2,3],[4,5,6]])
arr5

array([[1, 2, 3],
       [4, 5, 6]])

In [54]:
arr5*arr5

array([[ 1,  4,  9],
       [16, 25, 36]])

In [55]:
arr5-arr5

array([[0, 0, 0],
       [0, 0, 0]])

In [56]:
1/arr5

array([[1.        , 0.5       , 0.33333333],
       [0.25      , 0.2       , 0.16666667]])

In [58]:
arr5**0.5

array([[1.        , 1.41421356, 1.73205081],
       [2.        , 2.23606798, 2.44948974]])

In [59]:
arr6=np.array([[0,4,1],[7,2,12]])
arr6>arr5

array([[False,  True, False],
       [ True, False,  True]])

In [60]:
#切片时原数组的视图
#改变切片。改变原数组
arr7=np.arange(10)
slices=arr7[5:8]
slices[1]=12345
arr7

array([    0,     1,     2,     3,     4,     5, 12345,     7,     8,
           9])

In [61]:
slices[:]=64
arr7

array([ 0,  1,  2,  3,  4, 64, 64, 64,  8,  9])

In [62]:
#如果你想拷贝而非视图，需要显示声明
slices_copy=arr7[5:8].copy()
slices_copy[:]=32
arr7

array([ 0,  1,  2,  3,  4, 64, 64, 64,  8,  9])

In [63]:
slices_copy

array([32, 32, 32])

### 4.1.5 布尔索引

In [66]:
names=np.array(['Bob','Joe','Will','Bob','Will','Joe','Joe'])

bools=names=='Bob'
bools

array([ True, False, False,  True, False, False, False])

In [70]:
data=np.random.randn(7,4)

data

array([[ 0.13444581, -0.1378137 ,  2.55351283, -0.18624702],
       [-0.38887718,  0.91913225,  0.86577179, -1.0591978 ],
       [-0.47270445, -0.36743494,  0.39349706, -0.27206645],
       [ 1.04928203,  0.68166419, -0.75799183, -0.4898137 ],
       [-0.14549545, -0.31140865,  0.28515992,  0.42340786],
       [-1.41064552, -0.31080759,  0.21708288, -0.47865315],
       [ 0.27381159, -1.44817942,  1.20326374,  0.01755783]])

In [71]:
data[bools,2:]

array([[ 2.55351283, -0.18624702],
       [-0.75799183, -0.4898137 ]])

In [72]:
data[names!='Bob']

array([[-0.38887718,  0.91913225,  0.86577179, -1.0591978 ],
       [-0.47270445, -0.36743494,  0.39349706, -0.27206645],
       [-0.14549545, -0.31140865,  0.28515992,  0.42340786],
       [-1.41064552, -0.31080759,  0.21708288, -0.47865315],
       [ 0.27381159, -1.44817942,  1.20326374,  0.01755783]])

In [74]:
#使用~对一个条件取反
data[~(names=='Bob')]

array([[-0.38887718,  0.91913225,  0.86577179, -1.0591978 ],
       [-0.47270445, -0.36743494,  0.39349706, -0.27206645],
       [-0.14549545, -0.31140865,  0.28515992,  0.42340786],
       [-1.41064552, -0.31080759,  0.21708288, -0.47865315],
       [ 0.27381159, -1.44817942,  1.20326374,  0.01755783]])

In [76]:
data[data<0]=0
data

array([[0.13444581, 0.        , 2.55351283, 0.        ],
       [0.        , 0.91913225, 0.86577179, 0.        ],
       [0.        , 0.        , 0.39349706, 0.        ],
       [1.04928203, 0.68166419, 0.        , 0.        ],
       [0.        , 0.        , 0.28515992, 0.42340786],
       [0.        , 0.        , 0.21708288, 0.        ],
       [0.27381159, 0.        , 1.20326374, 0.01755783]])

In [77]:
data[names!='Joe']=7
data

array([[7.        , 7.        , 7.        , 7.        ],
       [0.        , 0.91913225, 0.86577179, 0.        ],
       [7.        , 7.        , 7.        , 7.        ],
       [7.        , 7.        , 7.        , 7.        ],
       [7.        , 7.        , 7.        , 7.        ],
       [0.        , 0.        , 0.21708288, 0.        ],
       [0.27381159, 0.        , 1.20326374, 0.01755783]])

In [80]:
#综合两个条件
condition1=data<10
condition2=names!='Joe'
union=(condition1.T&condition2).T
data[union]=9
data

array([[9.        , 9.        , 9.        , 9.        ],
       [0.        , 0.91913225, 0.86577179, 0.        ],
       [9.        , 9.        , 9.        , 9.        ],
       [9.        , 9.        , 9.        , 9.        ],
       [9.        , 9.        , 9.        , 9.        ],
       [0.        , 0.        , 0.21708288, 0.        ],
       [0.27381159, 0.        , 1.20326374, 0.01755783]])

### 4.1.6 神奇索引

In [82]:
#神奇索引得到一维数组
arr=np.arange(32).reshape((8,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23],
       [24, 25, 26, 27],
       [28, 29, 30, 31]])

In [83]:
arr[[1,5,7,2],[0,3,1,2]]

array([ 4, 23, 29, 10])

In [84]:
arr[[1,5,7,2],0]

array([ 4, 20, 28,  8])

In [85]:
#行列的子集得到的矩阵
arr[[1,5,7,2]][:,[0,3,1,2]]

array([[ 4,  7,  5,  6],
       [20, 23, 21, 22],
       [28, 31, 29, 30],
       [ 8, 11,  9, 10]])

### 4.1.7 数组转置和换轴

In [87]:
arr=np.random.randn(6,3)
arr

array([[ 0.75399645,  0.8777186 , -1.31773158],
       [-0.87232172, -1.67191717, -0.19625205],
       [-0.39836294, -0.47546482,  0.49944477],
       [ 0.41053691,  0.50195886,  1.0778954 ],
       [-0.97434114, -2.28144717, -1.01472559],
       [ 1.00789729,  0.35397309,  0.44075311]])

In [88]:
arr.dot(arr.T)

array([[ 3.0753171 , -1.86659277, -1.37582271, -0.6702548 , -1.39998243,
         0.48984545],
       [-1.86659277,  3.59476709,  1.04442139, -1.40889308,  4.86347163,
        -1.55752309],
       [-1.37582271,  1.04442139,  0.63420491,  0.13614275,  0.96608988,
        -0.34967884],
       [-0.6702548 , -1.40889308,  0.13614275,  1.58236174, -2.63896367,
         1.06654473],
       [-1.39998243,  4.86347163,  0.96608988, -2.63896367,  7.1840099 ,
        -2.23685017],
       [ 0.48984545, -1.55752309, -0.34967884,  1.06654473, -2.23685017,
         1.3354172 ]])

In [89]:
arr=np.arange(16).reshape((2,2,4))
arr

array([[[ 0,  1,  2,  3],
        [ 4,  5,  6,  7]],

       [[ 8,  9, 10, 11],
        [12, 13, 14, 15]]])

In [90]:
arr.transpose(1,0,2)

array([[[ 0,  1,  2,  3],
        [ 8,  9, 10, 11]],

       [[ 4,  5,  6,  7],
        [12, 13, 14, 15]]])

In [91]:
arr.swapaxes(1,2)

array([[[ 0,  4],
        [ 1,  5],
        [ 2,  6],
        [ 3,  7]],

       [[ 8, 12],
        [ 9, 13],
        [10, 14],
        [11, 15]]])

# 4.2 通用函数： 快速的逐元素数组函数

In [92]:
arr=np.arange(10)
arr

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [93]:
np.sqrt(arr)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [94]:
np.exp(arr)

array([1.00000000e+00, 2.71828183e+00, 7.38905610e+00, 2.00855369e+01,
       5.45981500e+01, 1.48413159e+02, 4.03428793e+02, 1.09663316e+03,
       2.98095799e+03, 8.10308393e+03])

In [95]:
x=np.random.randn(8)
y=np.random.randn(8)
x

array([ 0.72441017, -0.14238142, -0.31387432, -1.2652069 ,  0.57607251,
        0.17932009, -1.50264457,  0.65100357])

In [96]:
y

array([ 0.63425646, -0.51975154, -0.52827401,  0.78483272,  0.78501943,
       -0.61001026, -0.22299945, -0.41454977])

In [97]:
np.maximum(x,y)

array([ 0.72441017, -0.14238142, -0.31387432,  0.78483272,  0.78501943,
        0.17932009, -0.22299945,  0.65100357])

In [98]:
arr=np.random.randn(7)*5
arr

array([-0.19991076, -1.44164677, -5.76514375,  0.03153222,  2.40634318,
        3.96080797,  7.98774484])

In [99]:
remainder,whole_part=np.modf(arr)
remainder

array([-0.19991076, -0.44164677, -0.76514375,  0.03153222,  0.40634318,
        0.96080797,  0.98774484])

In [100]:
whole_part

array([-0., -1., -5.,  0.,  2.,  3.,  7.])

## 4.3 使用数组进行面向数组编程

In [102]:
points=np.arange(-5,5,0.01)
xs,ys=np.meshgrid(points,points)
xs

array([[-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       ...,
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99],
       [-5.  , -4.99, -4.98, ...,  4.97,  4.98,  4.99]])

In [103]:
ys

array([[-5.  , -5.  , -5.  , ..., -5.  , -5.  , -5.  ],
       [-4.99, -4.99, -4.99, ..., -4.99, -4.99, -4.99],
       [-4.98, -4.98, -4.98, ..., -4.98, -4.98, -4.98],
       ...,
       [ 4.97,  4.97,  4.97, ...,  4.97,  4.97,  4.97],
       [ 4.98,  4.98,  4.98, ...,  4.98,  4.98,  4.98],
       [ 4.99,  4.99,  4.99, ...,  4.99,  4.99,  4.99]])

In [104]:
z=np.sqrt(xs**2+ys**2)
z

array([[7.07106781, 7.06400028, 7.05693985, ..., 7.04988652, 7.05693985,
        7.06400028],
       [7.06400028, 7.05692568, 7.04985815, ..., 7.04279774, 7.04985815,
        7.05692568],
       [7.05693985, 7.04985815, 7.04278354, ..., 7.03571603, 7.04278354,
        7.04985815],
       ...,
       [7.04988652, 7.04279774, 7.03571603, ..., 7.0286414 , 7.03571603,
        7.04279774],
       [7.05693985, 7.04985815, 7.04278354, ..., 7.03571603, 7.04278354,
        7.04985815],
       [7.06400028, 7.05692568, 7.04985815, ..., 7.04279774, 7.04985815,
        7.05692568]])

### 4.3.1 将条件逻辑作为数组操作

In [106]:
#列表推导式的不足,仅限一维

xarr=np.array([1.1,1.2,1.3,1.4,1.5])
yarr=np.array([2.1,2.2,2.3,2.4,2.5])
cond=np.array([True,False,True,True,False])
[(x if c else y)
 for x,y,c in zip(xarr,yarr,cond)]

[1.1, 2.2, 1.3, 1.4, 2.5]

In [107]:
#使用np.where进行条件逻辑选择

np.where(cond,xarr,yarr)

array([1.1, 2.2, 1.3, 1.4, 2.5])

In [108]:
arr=np.random.randn(4,4)
np.where(arr>0,2,-2)

array([[ 2, -2, -2, -2],
       [-2,  2, -2, -2],
       [-2, -2,  2, -2],
       [-2, -2,  2,  2]])

In [109]:
np.where(arr>0,2,arr)

array([[ 2.        , -0.83529409, -0.99860713, -0.29760309],
       [-0.85660233,  2.        , -1.55573337, -0.02803003],
       [-0.17312654, -0.69242576,  2.        , -0.80151642],
       [-1.00762439, -0.35270706,  2.        ,  2.        ]])

### 4.3.2 数学和统计方法

In [111]:
arr=np.random.randn(5,4)
arr.mean()

-0.2187485320098923

In [112]:
np.mean(arr)

-0.2187485320098923

In [113]:
arr.sum()

-4.374970640197846

In [114]:
arr.mean(axis=1)

array([-0.05295751, -0.20906327, -1.50307646,  0.486559  ,  0.18479557])

In [115]:
arr.sum(axis=0)

array([-1.88074894, -1.56047649, -0.07959397, -0.85415125])

In [116]:
arr=np.arange(9).reshape((3,3))
arr

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [117]:
arr.cumsum(axis=0)

array([[ 0,  1,  2],
       [ 3,  5,  7],
       [ 9, 12, 15]], dtype=int32)

In [118]:
arr.cumprod(axis=1)

array([[  0,   0,   0],
       [  3,  12,  60],
       [  6,  42, 336]], dtype=int32)

In [119]:
arr.max(axis=1)

array([2, 5, 8])

In [120]:
arr.argmax(axis=1)

array([2, 2, 2], dtype=int64)

In [122]:
arr.std(ddof=1)

2.7386127875258306

### 4.3.3 布尔值数组的方法

In [123]:
#计算正数的个数

arr=np.random.randn(100)
(arr>0).sum()

49

In [124]:
#any检查是否存在True
#all检查是否全为True

bools=np.array([False,False,True,False])

bools.any()

True

In [125]:
bools.all()

False

### 4.3.4 排序

In [126]:
arr=np.random.randn(6)
arr.sort()
arr

array([-1.23269178, -0.05727851,  0.08224165,  0.12397068,  1.67542602,
        1.68059185])

In [127]:
#使用np.sort对元素组的拷贝排序

arr=np.random.randn(5,3)
arr

array([[ 1.00287513,  0.09304162, -0.50328241],
       [ 1.03557617, -0.93185328, -1.41681307],
       [ 1.10319306, -1.25554575, -0.56551613],
       [ 0.56735815,  0.64743068,  0.20435392],
       [-0.74733282,  1.00364995,  0.19667107]])

In [128]:
np.sort(arr,axis=1)

array([[-0.50328241,  0.09304162,  1.00287513],
       [-1.41681307, -0.93185328,  1.03557617],
       [-1.25554575, -0.56551613,  1.10319306],
       [ 0.20435392,  0.56735815,  0.64743068],
       [-0.74733282,  0.19667107,  1.00364995]])

In [129]:
arr

array([[ 1.00287513,  0.09304162, -0.50328241],
       [ 1.03557617, -0.93185328, -1.41681307],
       [ 1.10319306, -1.25554575, -0.56551613],
       [ 0.56735815,  0.64743068,  0.20435392],
       [-0.74733282,  1.00364995,  0.19667107]])

### 4.3.5 唯一值和其他逻辑集合

In [130]:
#使用np.unique返回唯一值排序后的拷贝

nmaes=np.array(['Bob','Joe','Will','Bob','Will','Joe','Joe'])
np.unique(names)

array(['Bob', 'Joe', 'Will'], dtype='<U4')

In [131]:
#纯python实现

sorted(set(names))

['Bob', 'Joe', 'Will']

In [132]:
#使用np.in1d检查一个数组的值是否在另一个数组中

values=np.array([6,0,0,3,2,5,6])
np.in1d(values, [2,3,6])

array([ True, False, False,  True,  True, False,  True])

方法|说明
--|--
unique(x)|求唯一值，并排序
intersect1d(x,y)|计算交集，并排序
union1d(x,y)|计算并集，并排序
in1d(x,y)|x的值是否在y中，返回一个布尔值数组
setdiff1d(x,y)|差集，在x中但不在y中的元素
setxor1d(x,y)|异或集，在x或y中，但不在x交y中的元素

# 4.4 使用数组进行文件输入和输出

In [133]:
arr=np.arange(10)
np.save('some_array', arr)

In [134]:
np.load('some_array.npy')

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [135]:
np.savez('array_archive.npz',a=arr,b=arr)

In [136]:
arch=np.load('array_archive.npz')
arch

In [137]:
arch['b']

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

## 4.5 线性代数

In [138]:
x=np.array([[1,2,3],[4,5,6]])
y=np.array([[6,23],[-1,7],[8,9]])

x

array([[1, 2, 3],
       [4, 5, 6]])

In [139]:
y

array([[ 6, 23],
       [-1,  7],
       [ 8,  9]])

In [140]:
x.dot(y)

array([[ 28,  64],
       [ 67, 181]])

In [141]:
np.dot(x,y)

array([[ 28,  64],
       [ 67, 181]])

In [142]:
np.dot(x,np.ones(3))

array([ 6., 15.])

In [143]:
#使用@用于点乘矩阵操作
np.ones(2)@x

array([5., 7., 9.])

函数|描述
--|--
diag|返回返回方阵的对角元素构成的一维数组，或者将一维数组中的元组构成一个对角方阵
dot|矩阵点乘
trace|计算迹
det|计算行列式
eig|计算特征值和特征向量
inv|计算方阵的逆矩阵
pinv|计算矩阵的Moore-Penrose伪逆
qr|计算QR分解
svd|计算奇异值分解
solve|求解Ax=b,其中A是方阵
lstsq|计算Ax=b的最小二乘解

# 4.6 伪随机数生成

In [144]:
np.random.seed(1234)

np.random.rand(10)

array([0.19151945, 0.62210877, 0.43772774, 0.78535858, 0.77997581,
       0.27259261, 0.27646426, 0.80187218, 0.95813935, 0.87593263])

In [145]:
np.random.rand(10)

array([0.35781727, 0.50099513, 0.68346294, 0.71270203, 0.37025075,
       0.56119619, 0.50308317, 0.01376845, 0.77282662, 0.88264119])

In [146]:
np.random.seed(1234)

np.random.rand(10)

array([0.19151945, 0.62210877, 0.43772774, 0.78535858, 0.77997581,
       0.27259261, 0.27646426, 0.80187218, 0.95813935, 0.87593263])

In [147]:
#使用RandomState生成一个独立于全局的随机数生成器

rng=np.random.RandomState(1234)
rng.rand(10)

array([0.19151945, 0.62210877, 0.43772774, 0.78535858, 0.77997581,
       0.27259261, 0.27646426, 0.80187218, 0.95813935, 0.87593263])

函数|描述
-|-
seed|向随机数生成器传递一个随机数种子
permutation|返回一个序列的随机排列，或返回一个乱序的整数范围序列
shuffle|对序列随机排序，并替代原序列
randint|从给定范围内抽取整数
binomial|
normal|
beta|
chisquare|
gamma|
uniform

# 5 pandas入门

## 5.1 pandas数据结构介绍

### 5.1.1 Series

In [148]:
import pandas as pd

obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [149]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [150]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [154]:
obj2=pd.Series([4,7,-5,3], index=list('dbac'))
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [155]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [157]:
obj2['a']

-5

In [159]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [160]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [161]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [162]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [163]:
'b' in obj2

True

In [164]:
'e' not in obj2

True

In [165]:
#根据字典生成Series

sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [166]:
states=['California','Ohio','Oregon','Texas']
obj4=pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [167]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [168]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [169]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [170]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [171]:
obj4+obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [172]:
obj4.name='population'
obj4.index.name='state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [173]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [174]:
obj.index=['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2 DataFrame

In [176]:
#使用等长度的列表或字典构建DataFrame

data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [177]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [180]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [184]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                    index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [185]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [186]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [187]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [188]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [190]:
frame2.debt=16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [192]:
#将列表或数组赋给一列时，长度必须相等

frame2.debt=range(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [193]:
val=pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

frame2.debt=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [194]:
#frame2.eastern无法创建新的列

frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [197]:
#使用del删除列
#无法对frame2.eastern进行删除

del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [201]:
#从DataFrame选取的列是视图，而不是拷贝
#对Series的更改会映射到DataFrame中
#如果需要复制，应显示的使用Series的copy方法

series1=frame2.debt
series1[:]=8
frame2

C:\Users\liudonghang\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

       year   state  pop  debt
one    2000    Ohio  1.5   8.0
two    2001    Ohio  1.7   8.0
three  2002    Ohio  3.6   8.0
four   2001  Nevada  2.4   8.0
five   2002  Nevada  2.9   8.0
six    2003  Nevada  3.2   8.0

In [203]:
#使用嵌套字典创建DataFrame

pop={'Nevada':{2001:2.4,2002:2.9},
     'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [204]:
#对索引选择与排序

pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [205]:
#包含Series的字典也可以创建DataFrame

pdata={'Ohio':frame3['Ohio'][:-1],
       'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [206]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [207]:
frame2.values

array([[2000, 'Ohio', 1.5, 8.0],
       [2001, 'Ohio', 1.7, 8.0],
       [2002, 'Ohio', 3.6, 8.0],
       [2001, 'Nevada', 2.4, 8.0],
       [2002, 'Nevada', 2.9, 8.0],
       [2003, 'Nevada', 3.2, 8.0]], dtype=object)

## 5.2 基本功能

### 5.2.1 重建索引

In [208]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [209]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [210]:
obj3=pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [211]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [213]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
                   columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [214]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [215]:
frame.reindex(columns=['Texas','Utah','California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [216]:
frame.loc[['a','b','c','d'],['Texas','Utah','California']]

C:\Users\liudonghang\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

参数|描述
-|-
method|'ffill'前向填充，'bfill'后向填充
fill_value|缺失值的替代值
limit|前向或后向填充时，所需填充的最大尺寸间隙（以元素数量）
tolerance|前后向填充时，所需填充的不精确匹配下的最大尺寸（以绝对数字距离）
level|匹配Multiindex级别的简单索引，否则为子集
copy|如果为True,新旧索引相同时复制底层数据，否则不复制

### 5.2.2 轴向上删除条目

In [218]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [219]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [220]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [222]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['Ohio','Colorado','Utah','New York'],
                  columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [224]:
#默认在axis=0上删除
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [225]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [226]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [227]:
obj.drop('c',inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### 5.2.3 索引、选择与过滤

In [228]:
obj=pd.Series(range(4),index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [229]:
obj[1:2]

b    1
dtype: int64

In [230]:
#使用索引的名称切片包含尾部
obj['b':'c']

b    1
c    2
dtype: int64

In [231]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [236]:
#选择标量和列表对应columns
#选择切片对应index

data['three']

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [237]:
data[['one','three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [233]:
data[:'three']

KeyError: 'three'

In [234]:
#同样，使用名称切片包含尾部

data[:'Utah']

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [235]:
data['Utah']

KeyError: 'Utah'

In [238]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [240]:
data['three']>5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [242]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [243]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [244]:
data[data<5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [245]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### 5.2.3.1 使用loc和iloc选择数据

In [246]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [247]:
data.iloc[1,[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [248]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [249]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [250]:
data.iloc[:,:3]=99
data

          one  two  three  four
Ohio       99   99     99     0
Colorado   99   99     99     7
Utah       99   99     99    11
New York   99   99     99    15

### 5.2.4 整数索引

In [251]:
#整数会引发歧义

ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [254]:
#整数索引为标签索引
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [255]:
#整数索引为位置索引

ser.iloc[:1]

0    0.0
dtype: float64

In [256]:
#直接选择根据位置索引

ser[:1]

0    0.0
dtype: float64

### 5.2.5 算术和数据对齐

In [259]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [260]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [261]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [262]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)),
                 index=['Ohio','Texas','Colorado'],
                 columns=list('bcd'))
df2=pd.DataFrame(np.arange(12.).reshape((4,3)),
                 index=['Utah','Ohio','Texas','Oregon'],
                 columns=list('bde'))
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [263]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [264]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 5.2.5.1 使用填充值的算术方法

In [265]:
df1=pd.DataFrame(np.arange(12.).reshape((3,4)),
                 columns=list('abcd'))
df2=pd.DataFrame(np.arange(20.).reshape((4,5)),
                 columns=list('abcde'))
df2.loc[1,'b']=np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [266]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [267]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [268]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [269]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

算术方法|描述
-|-
add,radd|+
sub,rsub|-
div,rdiv|/
lioordiv,rfloordiv|//
mul,rmul|*
pow,rpow|**

#### 5.2.5.2 DataFrame和Series间的操作

In [270]:
frame=pd.DataFrame(np.arange(12.).reshape((4,3)),
                   columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [271]:
series=frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [272]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [273]:
series2=pd.Series(range(3),index=list('bef'))
frame-series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [274]:
#如果想在列上广播，需要使用算术方法

series3=frame['d']
frame.sub(series3,axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 5.2.6 函数应用和映射

In [276]:
#将函数应用到每行或每列

frame=pd.DataFrame(np.random.rand(4,3),columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])

f=lambda x:x.max()-x.min()

frame.apply(f)

b    0.575997
d    0.433324
e    0.789373
dtype: float64

In [277]:
frame.apply(f,axis=1)

Utah      0.857759
Ohio      0.391528
Texas     0.552291
Oregon    0.658381
dtype: float64

In [278]:
#可以将带有多个值的Series传给apply

def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

frame.apply(f)

            b         d         e
min  0.075381  0.368824  0.143767
max  0.651378  0.802148  0.933140

In [279]:
#使用applymap逐元素的格式化字符串
 
format=lambda x:'%.2f'%x
frame.applymap(format)

           b     d     e
Utah    0.08  0.37  0.93
Ohio    0.65  0.40  0.79
Texas   0.32  0.57  0.87
Oregon  0.44  0.80  0.14

In [280]:
#Series有map方法

frame['e'].map(format)

Utah      0.93
Ohio      0.79
Texas     0.87
Oregon    0.14
Name: e, dtype: object

### 5.2.7 排序和排名

In [281]:
obj=pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [282]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [283]:
frame=pd.DataFrame(np.arange(8.).reshape((2,4)),
                   index=['three','one'],
                   columns=['d','a','b','c'])

frame.sort_index()

         d    a    b    c
one    4.0  5.0  6.0  7.0
three  0.0  1.0  2.0  3.0

In [285]:
frame.sort_index(axis=1)

         a    b    c    d
three  1.0  2.0  3.0  0.0
one    5.0  6.0  7.0  4.0

In [286]:
frame.sort_index(axis=1,ascending=False)

         d    c    b    a
three  0.0  3.0  2.0  1.0
one    4.0  7.0  6.0  5.0

In [287]:
obj=pd.Series([4,7,-3,2])

obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [288]:
obj=pd.Series([4,np.nan,7,np.nan,-3,2])

obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [289]:
#使用by将一列作为排序键

frame=pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [290]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [291]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [292]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [293]:
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [294]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [295]:
frame=pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [296]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

方法|描述
-|-
average|对相等的元素使用平均排名
min|使用最小
max|使用最大
first|按照元素在源数据中的次序排名
dense|类似于min,但组间排名总是加1，而不是相等元素数量

### 5.2.8 含有重复标签的轴索引

In [298]:
obj=pd.Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [299]:
obj.index.is_unique

False

In [300]:
obj['a']

a    0
a    1
dtype: int64

# 5.3 描述性统计的概述和计算

In [302]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
                index=['a','b','c','d'],
                columns=['one','two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [303]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [304]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

方法|描述
-|-
axis|
skipna|默认为True
level|多层索引下，可以缩减分组层级

In [305]:
#最大值的索引标签

df.idxmax()

one    b
two    d
dtype: object

In [306]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [307]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [308]:
obj=pd.Series(['a','a','b','c']*4)

obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [309]:
obj.value_counts()

a    8
c    4
b    4
dtype: int64

方法|描述
-|-
argmin,argmax|最小最大值的位置索引
idxmin,idxmax|最小最大值的标签索引
quantile|计算百分位数
mad|平均绝对偏差
prod|求积
cummin,cummax|累计和的最小最大值
diff|差分
pct_change|计算百分比

### 5.3.1 相关性和协方差

In [314]:
conda install pandas-datareader

Collecting package metadata: ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [319]:
import pandas_datareader.data as web

all_data={ticker:web.get_data_yahoo(ticker)
          for ticker in ['AAPL','IBM','MSFT','GOOG']}
price=pd.DataFrame({ticker:data['Adj Close']
                    for ticker,data in all_data.items()})
volumn=pd.DataFrame({ticker:data['Volume']
                     for ticker,data in all_data.items()})  #注：变量名写错，应为volume

In [322]:
#计算股价的百分比

returns=price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-06-03 -0.010110  0.010080 -0.031048 -0.061071
2019-06-04  0.036584  0.034459  0.027704  0.016232
2019-06-05  0.016143 -0.009044  0.021679 -0.010284
2019-06-06  0.014682  0.005552  0.015815  0.002034
2019-06-07  0.026617  0.008244  0.028008  0.020779

In [323]:
returns['MSFT'].corr(returns['IBM'])

0.48673816040937995

In [324]:
returns['MSFT'].cov(returns['IBM'])

8.696971255048906e-05

In [325]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.378663  0.452449  0.460647
IBM   0.378663  1.000000  0.486738  0.402620
MSFT  0.452449  0.486738  1.000000  0.537170
GOOG  0.460647  0.402620  0.537170  1.000000

In [326]:
returns.corrwith(returns.IBM)

AAPL    0.378663
IBM     1.000000
MSFT    0.486738
GOOG    0.402620
dtype: float64

In [329]:
returns.corrwith(volumn)

AAPL   -0.061776
IBM    -0.155913
MSFT   -0.089910
GOOG   -0.020277
dtype: float64

In [332]:
#使用axis=1逐行地计算相关系数
#在计算前，数据已经根据标签对齐
#删去成对数据中含有NA的数对，而不会删去含有NA的整行

corr_byrow=returns.corrwith(volumn,axis=1)

In [333]:
corr_byrow.head()

Date
2009-12-31         NaN
2010-01-04    0.791567
2010-01-05    0.737318
2010-01-06    0.016919
2010-01-07    0.507385
dtype: float64

### 5.3.2 唯一值、计数和成员属性

In [334]:
obj=pd.Series(['c','a','d','a','a','b','b','c','c'])

obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [335]:
#分类计数，自动降序排列

obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [336]:
#value_counts也是pandas的顶层方法

pd.value_counts(obj,sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [337]:
pd.value_counts(obj.values,sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [339]:
mask=obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [340]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [341]:
np.in1d(obj,['b','c'])

array([ True, False, False, False, False,  True,  True,  True,  True])

In [343]:
mask2=np.in1d(obj,['b','c'])
obj[mask2]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [344]:
#使用Index。get_indexer方法得到一个索引数组
#根据一个唯一值数组的索引，将另一个非唯一值数组转化

to_match=pd.Series(['c','a','b','b','c','a'])
unique_vals=pd.Series(['c','b','a'])

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [346]:
#对于DataFrame对象分类计数，综合每一列的值

data=pd.DataFrame({'Qu1':[1,3,4,3,4],
                   'Qu2':[2,3,1,2,3],
                   'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [348]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [349]:
data.apply(pd.value_counts,axis=1).fillna(0)

     1    2    3    4    5
0  2.0  1.0  0.0  0.0  0.0
1  0.0  0.0  2.0  0.0  1.0
2  1.0  1.0  0.0  1.0  0.0
3  0.0  1.0  1.0  1.0  0.0
4  0.0  0.0  1.0  2.0  0.0

# 6 数据载入、存储及文件格式

## 6.1 文本格式数据的读写

函数|描述
-|-
read_csv|
read_clipboard|从剪切板读取数据
read_excel|
read_html|
read_sas|
read_sql|
read_stata

In [4]:
!type examples\\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [5]:
import pandas as pd

df=pd.read_csv('examples\ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!type examples\\ex2.txt

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
#不含表头

pd.read_csv('examples\ex2.txt',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('examples\ex2.txt',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
#将message列作为索引

names=['a','b','c','d','message']
pd.read_csv('examples\ex2.txt',names=names,index_col='message' )

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!type examples\csv_mindex.csv

key1, key2,value1,value2
one, a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [13]:
parsed=pd.read_csv('examples\csv_mindex.csv',index_col=['key1',' key2'])   #注意key2前有一个空格
parsed

            value1  value2
key1  key2
one   a          1       2
     b           3       4
     c           5       6
     d           7       8
two  a           9      10
     b          11      12
     c          13      14
     d          15      16

In [14]:
parsed.index

MultiIndex(levels=[['one', 'two'], [' a', 'a', 'b', 'c', 'd']],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 2, 3, 4, 1, 2, 3, 4]],
           names=['key1', ' key2'])

In [15]:
list(open('examples\ex3.txt'))

['                 A         B            C\n',
 'aaa          -0.26    -1.03      -6.20\n',
 'bbb         0.93     0.30        -0.03\n',
 'ccc           -0.26    -0.39     -0.22\n',
 'ddd          -0.87     -0.35    1.10']

In [16]:
#检测到第一行少一列，因此其他列第一列自动作为索引

pd.read_csv('examples\ex3.txt',sep='\s+')

        A     B     C
aaa -0.26 -1.03 -6.20
bbb  0.93  0.30 -0.03
ccc -0.26 -0.39 -0.22
ddd -0.87 -0.35  1.10

In [17]:
list(open('examples\ex3_2.txt'))

['   Letter                 A         B            C\n',
 'aaa          -0.26    -1.03      -6.20\n',
 'bbb         0.93     0.30        -0.03\n',
 'ccc           -0.26    -0.39     -0.22\n',
 'ddd          -0.87     -0.35    1.10']

In [19]:
#检测到每一行列数相等，自动添加位置索引

pd.read_csv('examples\ex3_2.txt',sep='\s+')

  Letter     A     B     C
0    aaa -0.26 -1.03 -6.20
1    bbb  0.93  0.30 -0.03
2    ccc -0.26 -0.39 -0.22
3    ddd -0.87 -0.35  1.10

In [21]:
!type examples\ex4.txt

#嘿！
a,b,c,d,message
#只是为了让你觉得更难
#谁用计算机读取csv文件？
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [24]:
pd.read_csv('examples\ex4.txt',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
!type examples\ex5.txt

something,a, b,c,d,message
one,1,2,3.0,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [29]:
#识别缺失值，通过空字符串，NA,NULL

result=pd.read_csv('examples\ex5.txt')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
#使用缺失值标识

pd.read_csv('examples\ex5.txt',na_values=['NULL'])

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
sentinels={'message':'foo','something':'two'}

pd.read_csv('examples\ex5.txt',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

参数|描述
-|-
sep,delimiter|分隔符正则表达式
header|
index_col|作为索引的列，可以是分层索引
names|列名列表，与header=None连用
skiprows|从文件开头起，跳过的行数或行号列表
na_values|添加缺失值标识符，可以使用字典
nrows|从文件开头处读入的行数
chunksize|迭代块的大小
skip_footer|忽略文件尾部的行数
encoding|Unicode文本编码

### 6.1.1 分块读入文本文件

In [36]:
#首位各显示5行

pd.options.display.max_rows=10

### 6.1.2 将数据写入文本格式

In [37]:
data=pd.read_csv('examples\ex5.txt')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
data.to_csv('examples\out.csv')

In [39]:
!type examples\out.csv

,something,a, b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [40]:
data.to_csv('examples\out1.csv',sep='|')

In [41]:
!type examples\out1.csv

|something|a| b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [42]:
data.to_csv('examples\out2.csv',na_rep='NULL')

In [43]:
!type examples\out2.csv

,something,a, b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [44]:
#不写入行列

data.to_csv('examples\out3.csv',index=False,header=False)

!type examples\out3.csv

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [45]:
#写入子集

data.to_csv('examples\out4.csv',columns=['a','b','c'])

!type examples\out4.csv

C:\Users\liudonghang\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

,a,b,c
0,1,,3.0
1,5,,
2,9,,11.0

In [1]:
#Series的to_csv方法

import pandas as pd

dates=pd.date_range('1/1/2000', periods=7)

ts=pd.Series(range(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int64

### 6.1.3 使用分隔格式

In [10]:
!type examples\ex7.txt

"a","b","c"
"1","2","3"
"1","2","3"

In [12]:
import csv

f=open('examples\ex7.txt')

reader=csv.reader(f)

for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [14]:
with open('examples\ex7.txt') as f:
    lines=list(csv.reader(f))
    
header,values=lines[0],lines[1:]
data_dict={h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [15]:
with open('examples\out1.csv') as f:
    reader2=csv.reader(f,delimiter='|')
    for line in reader2:
        print(line)

['', 'something', 'a', ' b', 'c', 'd', 'message']
['0', 'one', '1', '2', '3.0', '4', '']
['1', 'two', '5', '6', '', '8', 'world']
['2', 'three', '9', '10', '11.0', '12', 'foo']

In [18]:
#定义一个csv的方言类
#使用csv.writer写入文件

class my_dialect(csv.Dialect):
    lineterminator='\n'
    delimiter=';'
    quotechar='"'
    quoting=csv.QUOTE_MINIMAL

with open('examples\mydata.csv','x') as f:
    writer=csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [19]:
!type examples\mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

### 6.1.5 XML和HTML:网络抓取